class DBConfig:
    DB_SETTINGS = {
        "host": "head-postgres",
        "port": 5432,
        "database": "head",
        "user": "postgres",
        "password": "1"
    }
    
    CONFIG = {
        "tables": {
            "темы_дипломных_работ": {
                "fields": ["id", "Фамилия", "Имя", "Отчество", "Группа", "Название темы", "Год"],
                "query": "SELECT id, фамилия, имя, отчество, группа, название_темы, год FROM темы_дипломных_работ ORDER BY id"
            },
            "диапазон_стипендий": {
                "fields": ["id", "Нижний порог", "Верхний порог", "Сумма"],
                "query": "SELECT id, нижний_порог, верхний_порог, сумма FROM диапазон_стипендий ORDER BY id"
            },
            "пользователи": {
                "fields": ["id", "Фамилия", "Имя", "Отчество", "Роль", "Логин"],
                "query": "SELECT id, фамилия, имя, отчество, CASE WHEN роль = 'TEACHER' THEN 'Преподаватель' ELSE 'Зав. Отделением' END, логин FROM пользователи ORDER BY id"
            },
            "специальности": {
                "fields": ["id", "Название специальности"],
                "query": "SELECT id, название_специальности FROM специальности ORDER BY id"
            },
            "группы": {
                "fields": ["id", "Название группы", "Номер курса", "Название специальности"],
                "query": "SELECT id, название_группы, номер_курса, (SELECT название_специальности FROM специальности WHERE специальности.id = г.id_специальности) AS название_специальности FROM группы г ORDER BY г.id"
            },
            "студенты": {
                "fields": ["id", "Фамилия", "Имя", "Отчество", "Название группы", "Комментарий к студенту", "Средний балл", "Сумма надбавки","Дисциплинарные взыскания", "Стипендия"],
                "query": "SELECT id, фамилия, имя, отчество, (SELECT название_группы FROM группы WHERE id = с.id_группы) as название_группы, комментарий_к_студенту, средний_балл, (SELECT COALESCE((SELECT MAX(сумма) FROM надбавки WHERE id_студента = с.id), 0)) AS сумма_надбавки, (SELECT COUNT(*) FROM взыскания WHERE id_студента = с.id) AS дисциплинарные_взыскания, (SELECT (COALESCE((SELECT сумма FROM диапазон_стипендий WHERE с.средний_балл BETWEEN нижний_порог AND верхний_порог LIMIT 1), 0) + COALESCE((SELECT MAX(сумма) FROM надбавки WHERE id_студента = с.id), 0))) as стипендия FROM студенты с ORDER BY с.id;"
            },
            "взыскания": {
                "fields": ["id", "Фамилия", "Имя", "Отчество", "Описание", "Дата начала", "Дата конца"],
                "query": "SELECT взыскания.id, с.фамилия, с.имя, с.отчество, взыскания.описание, взыскания.дата_начала, взыскания.дата_конца FROM взыскания INNER JOIN public.студенты с on с.id = взыскания.id_студента ORDER BY взыскания.id"
            },
            "надбавки": {
                "fields": ["id", "Фамилия", "Имя", "Отчество", "Причина надбавки", "Сумма", "Дата начала", "Дата конца"],
                "query": "SELECT надбавки.id, с.фамилия, с.имя, с.отчество, надбавки.причина_надбавки, надбавки.сумма, надбавки.дата_начала, надбавки.дата_конца FROM надбавки INNER JOIN public.студенты с on с.id = надбавки.id_студента ORDER BY надбавки.id"
            },
            "заметки": {
                "fields": ["id", "Заголовок", "Содержание", "Дата создания", "Режим доступа"],
                "query": "SELECT id, заголовок, содержание, дата_создания, CASE WHEN режим_доступа = 'ALL' THEN 'Для всех' ELSE 'Только для меня' END FROM заметки ORDER BY id;"
            },
        },
    }
